# Pandas and NumPy Fundamentals

### Working with missing data

- Read the file titanic_survival.csv into a dataframe called titanic_survival.

In [1]:
import pandas as pd

titanic_survival = pd.read_csv("titanic_survival.csv")

titanic_survival.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

- Count how many values in the "age" column have null values:
    - Use pandas.isnull() on age variable to create a Series of True and False values.
    - Use the resulting series to select only the elements in age that are null, and assign the result to age_null_true
    - Assign the length of age_null_true to age_null_count.
- Print age_null_count to see how many null values are in the "age" column.

In [2]:
age = titanic_survival["age"]
age_is_null = pd.isnull(age)
age_null_true = age[age_is_null]
age_null_count = len(age_null_true)
print(age_null_count)

264

- Use age_is_null to create a vector that only contains values from the "age" column that aren't NaN.
- Calculate the mean of the new vector, and assign the result to correct_mean_age.

In [3]:
good_ages = titanic_survival["age"][age_is_null == False]
correct_mean_age = sum(good_ages) / len(good_ages)
correct_mean_age

29.8811345124283

- Assign the mean of the "fare" column to correct_mean_fare.

In [4]:
correct_mean_fare = titanic_survival["fare"].mean()
correct_mean_fare

33.29547928134572

- Use a for loop to iterate over passenger_classes. Within the for loop:
    - Select just the rows in titanic_survival where the pclass value is equivalent to the current iterator value (class).
    - Select just the fare column for the current subset of rows.
    - Use the Series.mean method to calculate the mean of this subset.
    - Add the mean of the class to the fares_by_class dictionary with class as the key.
- Once the loop completes, the dictionary fares_by_class should have 1, 2, and 3 as keys, with the average fares as the corresponding values.

In [5]:
passenger_classes = [1, 2, 3]
fares_by_class = {}

for pclass in passenger_classes:
    pclass_rows = titanic_survival[titanic_survival["pclass"] == pclass]
    pclass_fares = pclass_rows["fare"]
    fare_for_class = pclass_fares.mean()
    fares_by_class[pclass] = fare_for_class
    
fares_by_class

{1: 87.50899164086687, 2: 21.1791963898917, 3: 13.302888700564957}

- Use the DataFrame.pivot_table() method to calculate the mean age for each passenger class ("pclass").
- Assign the result to passenger_age.
- Display the passenger_age pivot table using the print() function.

In [6]:
import numpy as np

passenger_age = titanic_survival.pivot_table(index="pclass", values="age")
print(passenger_age)

              age
pclass
1.0     39.159918
2.0     29.506705
3.0     24.816367

- Make a pivot table that calculates the total fares collected ("fare") and total number of survivors ("survived") for each embarkation port ("embarked").
- Assign the result to port_stats.
- Display port_stats using the print() function.

In [7]:
port_stats = titanic_survival.pivot_table(index="embarked", values=["fare", "survived"], aggfunc=np.sum)
port_stats

                fare  survived
embarked
C         16830.7922     150.0
Q          1526.3085      44.0
S         25033.3862     304.0

- Drop all columns in titanic_survival that have missing values and assign the result to drop_na_columns.
- Drop all rows in titanic_survival where the columns "age" or "sex" have missing values and assign the result to new_titanic_survival.

In [8]:
drop_na_columns = titanic_survival.dropna(axis = 1)
new_titanic_survival = titanic_survival.dropna(axis = 0, subset = ["age", "sex"])

- Assign the first ten rows from new_titanic_survival to first_ten_rows.
- Assign the fifth row from new_titanic_survival to row_position_fifth.
- Assign the row with index label 25 from new_titanic_survivalto row_index_25.

In [9]:
first_ten_rows = new_titanic_survival.iloc[:10]
row_position_fifth = new_titanic_survival.iloc[4]
row_index_25 = new_titanic_survival.loc[25]

In [10]:
first_ten_rows

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1.0,1.0,"Anderson, Mr. Harry",male,48.0000,0.0,0.0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1.0,1.0,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1.0,0.0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1.0,0.0,"Andrews, Mr. Thomas Jr",male,39.0000,0.0,0.0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1.0,1.0,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2.0,0.0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1.0,0.0,"Artagaveytia, Mr. Ramon",male,71.0000,0.0,0.0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [11]:
row_position_fifth

pclass                                                     1
survived                                                   0
name         Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
sex                                                   female
age                                                       25
sibsp                                                      1
parch                                                      2
ticket                                                113781
fare                                                  151.55
cabin                                                C22 C26
embarked                                                   S
boat                                                     NaN
body                                                     NaN
home.dest                    Montreal, PQ / Chesterville, ON
Name: 4, dtype: object

In [12]:
row_index_25

pclass                         1
survived                       0
name         Birnbaum, Mr. Jakob
sex                         male
age                           25
sibsp                          0
parch                          0
ticket                     13905
fare                          26
cabin                        NaN
embarked                       C
boat                         NaN
body                         148
home.dest      San Francisco, CA
Name: 25, dtype: object

- Assign the value at row index label 1100, column index label "age" from new_titanic_survival to row_index_1100_age.
- Assign the value at row index label 25, column index label "survived" from new_titanic_survival to row_index_25_survived.
- Assign the first 5 rows and first three columns from new_titanic_survival to five_rows_three_cols.

In [14]:
row_index_1100_age = new_titanic_survival.loc[1100, "age"]
row_index_25_survived = new_titanic_survival.loc[25, "survived"]
five_rows_three_cols = new_titanic_survival.iloc[:5, :3]

In [15]:
row_index_1100_age

29.0

In [16]:
row_index_25_survived

0.0

In [17]:
five_rows_three_cols

   pclass  survived                                             name
0     1.0       1.0                    Allen, Miss. Elisabeth Walton
1     1.0       1.0                   Allison, Master. Hudson Trevor
2     1.0       0.0                     Allison, Miss. Helen Loraine
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

- Reindex the new_titanic_survival dataframe so the row indexes start from 0, and the old index is dropped.
- Assign the final result to titanic_reindexed.
- Print the first 5 rows and the first 3 columns of titanic_reindexed.

In [18]:
titanic_reindexed = new_titanic_survival.reset_index(drop = True)
print(titanic_reindexed.iloc[:5, :3])

   pclass  survived                                             name
0     1.0       1.0                    Allen, Miss. Elisabeth Walton
1     1.0       1.0                   Allison, Master. Hudson Trevor
2     1.0       0.0                     Allison, Miss. Helen Loraine
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

- Write a function that counts the number of null elements in a Series.
- Use the DataFrame.apply() method along with your function to run across all the columns in titanic_survival.
- Assign the result to column_null_count.

In [19]:
def null_count(column):
    column_null = pd.isnull(column)
    null = column[column_null]
    return len(null)

column_null_count = titanic_survival.apply(null_count)
column_null_count

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

- Create a function that returns the string "minor" if someone is under 18, "adult" if they are equal to or over 18, and "unknown" if their age is null.
- Then, use the function along with .apply() to find the correct label for everyone in the titanic_survival dataframe.
- Assign the result to age_labels.
- You can use pd.isnull to check if a value is null or not.

In [20]:
def generate_age_label(row):
    age = row["age"]
    if pd.isnull(age):
        return "unknown"
    elif age < 18:
        return "minor"
    else:
        return "adult"

age_labels = titanic_survival.apply(generate_age_label, axis=1)
age_labels

0         adult
1         minor
2         minor
3         adult
4         adult
5         adult
6         adult
7         adult
8         adult
9         adult
10        adult
11        adult
12        adult
13        adult
14        adult
15      unknown
16        adult
17        adult
18        adult
19        adult
20        adult
21        adult
22        adult
23        adult
24        adult
25        adult
26        adult
27        adult
28        adult
29        adult
         ...
1280      adult
1281      adult
1282    unknown
1283    unknown
1284    unknown
1285      adult
1286      adult
1287      adult
1288      adult
1289      adult
1290      adult
1291    unknown
1292    unknown
1293    unknown
1294      adult
1295      adult
1296      adult
1297    unknown
1298      adult
1299      adult
1300      minor
1301      adult
1302    unknown
1303    unknown
1304      minor
1305    unknown
1306      adult
1307      adult
1308      adult
1309    unknown
Length: 1310, dtype: object

- Create a pivot table that calculates the mean survival chance("survived") for each age group ("age_labels") of the dataframe titanic_survival.
- Assign the resulting Series object to age_group_survival.

In [22]:
titanic_survival["age_labels"] = age_labels

In [23]:
age_group_survival = titanic_survival.pivot_table(index="age_labels", values="survived")
age_group_survival

            survived
age_labels
adult       0.387892
minor       0.525974
unknown     0.277567